OpenFOAM_Maincode/tutorials/incompressibleVoF/damBreakPorousBaffle/0/epsilon.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    leftWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    rightWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
